// Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох.
// Також потрібно врахувати коли введені рівні числа.
a1 = prompt("Введіть 1 число");
a2 = prompt("Введіть 2 число)");
if (a1 > a2) {
    console.log("число 1 > числа 2");
} else if (a1 < a2) {
    console.log("число 2 > числа 1");
} else {
    console.log("Числа рівні!");
}

// У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
let Flat = prompt("Введіть номер квартири");
debugger
if (typeof Flat === "number" && Flat % 1 === 0) {
    if (Flat >= 1 && Flat <= 20) {
        console.log("Квартира знаходиться у 1-му під'їзді");
    } else if (Flat >= 21 && Flat <= 48) {
        console.log("Квартира знаходиться у 2-му під'їзді");
    } else if (Flat >= 21 && Flat <= 48) {
        console.log("Квартира знаходиться у 3-му під'їзді");
    } else {
        console.log("Не знаю ");
    }
} else {
    alert("Введіть ціле число!!");
}

// Ми маємо змінну number в яку користувач задає числове значення, якщо змінна дорівнює 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
let b = prompt("Введіть число:");
if (typeof b === "number") {
    if (b === 10) {
        console.log("ВІРНО");
    } else {
        console.log("НЕВІРНО");
    }
} else {
    alert("Введіть число!!!");
}

// Ми маємо змінну x в яку користувач задає значення, якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

let x = prompt("Введіть данні:");
switch (typeof x) {
    case "number": {
        console.log(1);
        break;
    }
    case "string": {
        console.log(2);
        break;
    }
    case "boolean": {
        console.log(3);
        break;
    }
    case "object": {
        console.log(3);
        break;
    }
    default: {
        console.log("Я не знаю що це!!!");
    }
}
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ.
// Якщо інша температура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let Temp = prompt("Введіть температуру:");
if (typeof Temp === "number") {
    if (Temp >= 10 && Temp <= 22) {
        console.log("ми йдемо ВЧИТИСЯ");
    } else {
        console.log("сидимо вдома і вчимося ОНЛАЙН");
    }
} else {
    alert("Введіть число!!!");
}

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І в залежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді вивести Повідомлення - що число не вірне ... .
let c = prompt("Введіть число:");
if (typeof c === "number") {
    switch (c) {
        case 1: {
            console.log("Авто");
            break;
        }
        case 2: {
            console.log("Мото");
            break;
        }
        case 3: {
            console.log("Телефон");
            break;
        }
        case 4: {
            console.log("...і т.д.");
            break;
        }
        case 5: {
            console.log("...і т.п.");
            break;
        }
        default: {
            console.log("Не правильне число!!!");
        }
    }
} else {
    alert("Введіть число!!!");
}
