// // - Дано натуральное число n. Выведите все числа от 1 до n.
// console.log("Дано натуральное число n. Выведите все числа от 1 до n.");
// let numOutput = (n) => {
//     if (!isNaN(n) && n % 1 === 0 && n > 0) {
//         for (let i = 1; i <= n; i++) {
//             console.log(i);
//         }
//     } else {
//         console.log("Введіть натуральне число");
//     }
// }

// numOutput(Number(prompt("Введіть натуральне число:")))

// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.
console.log("Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.");
let outputNumFromTo = (a, b) => {
    //Конструкция чуть избыточна, но легче читается.
    if ((!isNaN(a) && a % 1 === 0) && (!isNaN(b) && b % 1 === 0)) {
        let i = a < b ? a : b;
        while ()


        console.log(a < b)

        console.log(a < b ? a : b)
        console.log(a < b ? b : a)
        console.log(a < b ? "i++" : "i--")
        console.log(`for (let i = ${a < b ? a : b}; i < ${a < b ? b : a}; ${a < b ? "i++" : "i--"})`);
    } else {
        console.log("Введіть цілі числа!!!!")
    }
}
outputNumFromTo(Number(prompt("Введіть 1 число:")), Number(prompt("Введіть 2 число:")))

//
//
// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
//
// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]
