// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
let a = prompt("Введіть хвилини:");
if (!isNaN(+a) && a > 0 && a < 60) {
    console.log(`Число попадає в ${Math.trunc(Number(a))} частину години`);
} else {
    alert("Введіть число!!!");
}
// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
let day = prompt();
if (!isNaN(+day) && day > 1 && a <= 31) {
    console.log(`Число попадає в ${Math.trunc(Number(day) / 14) + 1} декаду місяця`);
} else {
    alert("Введіть число!!!");
}

// Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.

let test = true;
if (test) {
    console.log("Вірно");
} else {
    console.log("Неправильно");
}

console.log(test ? "Правильно" : "Неправильно");

// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
let a1 = prompt("Введіть число:");
console.log(!isNaN(+a1) && +a1 === 0 ? "Вірно" : "Невірно");

let dayOfWeek = prompt("Введіть день тижня");
switch (dayOfWeek) {
    case "1" : {
        console.log("Роби щось, початок тижня!!!");
        break;
    }
    case "2": {
        console.log("Сьогодні тільки Вівторок!!!");
        break;
    }
    case "3": {
        console.log("За середину перевалюємо.");
        break;
    }
    case "4": {
        console.log("Чую кінець тижня!!");
        break;
    }
    case "5": {
        console.log("Нам би день простояти, та ніч протриматись)))");
        break;
    }
    case "6": {
        console.log("Розслабляємось!!!");
        break;
    }
    case "7": {
        console.log("Готуємось до роботи");
        break;
    } default:{
        console.log("А це, що таке??")
    }
}

// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

let Year = prompt("Введіть рік:");
debugger

if (!isNaN(+Year) && new Date(+Year, 2, 0).getDate() === 28) {
    console.log("Звичайний рік")
} else {
    console.log("Високосний рік")
}